In [37]:
import pandas as pd
train = pd.read_csv('./data/train.csv')
test = pd.read_csv('./data/test.csv')
# print(train.info())
# print(test.info())
test.shape

(418, 11)

In [38]:
train

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [39]:
train['Age'].isnull().sum()

177

In [40]:
#Use the Regular Expression to get the title from the name field.
import re
pattern = re.compile(r'.*?,(.*?)\.')
def getTitle(x):
    result = pattern.search(x)
    if result:
        return result.group(1).strip()
    else:
        return ''

train['Title'] = train['Name'].map(getTitle)
test['Title'] = test['Name'].map(getTitle)

# print('*' * 20, 'number of data is not null')
# print(train['Title'][train['Age']>0].value_counts())
# print('=' * 20, 'number of data is null')

# #Check how many rows missing the Age by Title
# print(train['Title'][train['Age'].isnull()].value_counts())
# print(test['Title'][test['Age'].isnull()].value_counts())


#Set the missing Age of Title 'Master' 
master_age_mean = train['Age'][(train['Title']=='Master')&(train['Age']>0)].mean()

# Debug - how to get the index and the colum on that index.
# print('*' * 20)
# print(train.loc[train[(train['Title']=='Master')&(train['Age'].isnull())].index])
# print(train.loc[train[(train['Title']=='Master')&(train['Age'].isnull())].index, 'Age'])

train.loc[train[(train['Title']=='Master')&(train['Age'].isnull())].index, 'Age'] = master_age_mean
test.loc[test[(test['Title']=='Master')&(test['Age'].isnull())].index, 'Age'] = master_age_mean

#Set the missing Age of Title 'Mr' 
mr_age_mean = train['Age'][(train['Title']=='Mr')&(train['Age']>0)].mean()
train.loc[train[(train['Title']=='Mr')&(train['Age'].isnull())].index, 'Age'] = mr_age_mean
test.loc[test[(test['Title']=='Mr')&(test['Age'].isnull())].index, 'Age'] = mr_age_mean

#Set the missing Age of Title 'Miss' or 'Ms'
miss_age_mean = train['Age'][(train['Title']=='Miss')&(train['Age']>0)].mean()
train.loc[train[(train['Title']=='Miss')&(train['Age'].isnull())].index, 'Age'] = miss_age_mean
test.loc[test[((test['Title']=='Miss')|(test['Title']=='Ms'))&(test['Age'].isnull())].index, 'Age'] = miss_age_mean

#Set the missing Age of Title 'Mrs' 
mrs_age_mean = train['Age'][(train['Title']=='Mrs')&(train['Age']>0)].mean()
train.loc[train[(train['Title']=='Mrs')&(train['Age'].isnull())].index, 'Age'] = mrs_age_mean
test.loc[test[(test['Title']=='Mrs')&(test['Age'].isnull())].index, 'Age'] = mrs_age_mean

#Set the missing Age of Title 'Dr' 
dr_age_mean = train['Age'][(train['Title']=='Dr')&(train['Age']>0)].mean()
train.loc[train[(train['Title']=='Dr')&(train['Age'].isnull())].index, 'Age'] = dr_age_mean
test.loc[test[(test['Title']=='Mrs')&(test['Age'].isnull())].index, 'Age'] = dr_age_mean

# print(train['Age'].describe())
# print(test['Age'].describe())
print(train.shape)
train.head(3)

(891, 13)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss

In [41]:
train['Age'].isnull().sum()

0

In [42]:
pd.unique(train['Title'])
# type(train)

array(['Mr', 'Mrs', 'Miss', 'Master', 'Don', 'Rev', 'Dr', 'Mme', 'Ms',
       'Major', 'Lady', 'Sir', 'Mlle', 'Col', 'Capt', 'the Countess',
       'Jonkheer'], dtype=object)

In [43]:
train = train.drop(['Name','PassengerId'], 1) # 1 for column and 0 for row

In [44]:
combine = [train, test]
for train in combine: 
    train['Title'] = train['Title'].replace(['Lady', 'Countess','Capt', 'Col',\
 	'Don', 'Dr', 'Major', 'Rev', 'Sir', 'Jonkheer', 'Dona'], 'Rare')
    train['Title'] = train['Title'].replace('Mlle', 'Miss')
    train['Title'] = train['Title'].replace('Ms', 'Miss')
    train['Title'] = train['Title'].replace('Mme', 'Mrs')
    
combine[0].head(3)
# pd.unique(train['Title'])

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
0,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr
1,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs
2,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss

In [45]:
for train in combine: 
    print(train.shape)

(891, 11)
(418, 12)

In [46]:
train.Cabin.isnull().sum()
# pd.unique(train.Cabin)

327

In [47]:
for train in combine: 
    train['Cabin'] = train['Cabin'].fillna("XX");
    train['Cabin'].replace('A.*', "A", regex=True, inplace=True)
    train['Cabin'].replace('B.*', "B", regex=True, inplace=True)
    train['Cabin'].replace('C.*', "C", regex=True, inplace=True)
    train['Cabin'].replace('D.*', "D", regex=True, inplace=True)
    train['Cabin'].replace('E.*', "E", regex=True, inplace=True)
    train['Cabin'].replace('F.*', "F", regex=True, inplace=True)
    
combine[0].head(3)

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
0,0,3,male,22.0,1,0,A/5 21171,7.2500,XX,S,Mr
1,1,1,female,38.0,1,0,PC 17599,71.2833,C,C,Mrs
2,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,XX,S,Miss

In [48]:
for dataset in combine:
   dataset.rename(columns={"Fare":"Spending", "Survived":"Involoved", "Cabin":"Product",\
                           "Parch":"Channel", "Embarked": "Location", "Pclass":"Class"}, inplace=True)

combine[0].head(3)

,Involoved,Class,Sex,Age,SibSp,Channel,Ticket,Spending,Product,Location,Title
0,0,3,male,22.0,1,0,A/5 21171,7.2500,XX,S,Mr
1,1,1,female,38.0,1,0,PC 17599,71.2833,C,C,Mrs
2,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,XX,S,Miss

In [49]:
for train in combine: 
    train['SpendingCat'] = pd.cut(train['Spending'], [-0.1, 50, 100, 150, 200, 300, 1000], right=True, 
        labels=[0, 1, 2, 3, 4, 5])
    train['AgeCat'] = pd.cut(train['Age'], [-0.1, 12.1, 20, 30, 35, 40, 45, 50, 55, 65, 100], right=True, 
        labels=[0, 1, 2, 3, 4, 5, 6, 7, 8, 9])
    train.drop(columns='SibSp', inplace=True)
    train.drop(columns='Ticket', inplace=True)
    
combine[0].to_csv('./data/user_train.csv')
combine[1].to_csv('./data/user_test.csv')
combine[0].head(3)

,Involoved,Class,Sex,Age,Channel,Spending,Product,Location,Title,SpendingCat,AgeCat
0,0,3,male,22.0,0,7.2500,XX,S,Mr,0,2
1,1,1,female,38.0,0,71.2833,C,C,Mrs,1,4
2,1,3,female,26.0,0,7.9250,XX,S,Miss,0,2

# Done fake the data and start to process them for the model.

In [50]:
for data in combine:
    data.drop(columns='Spending', inplace=True)
    data.drop(columns='Age', inplace=True)
    
combine[0].head(3)

   Involoved  Class     Sex  Channel Product Location Title SpendingCat AgeCat
0          0      3    male        0      XX        S    Mr           0      2
1          1      1  female        0       C        C   Mrs           1      4
2          1      3  female        0      XX        S  Miss           0      2

In [51]:

# TODO: do not use one-hot, this is not good for NN, 
# becasue the number of columns can be different between train and prodict and we cannot define the input dim for NN.
from sklearn.model_selection import train_test_split

columns = ['Involoved','Class', 'Sex', 'Channel', 'Product', 'Location', 'Title', 'SpendingCat']

data_age_cat = combine[0]['AgeCat']
data_without_age = combine[0].drop(columns='AgeCat')
data_one_hot = pd.get_dummies(data_without_age)
data_one_hot['AgeCat'] = data_age_cat

X_train, X_test, y_train, y_test = train_test_split(data_one_hot, data_age_cat, test_size=0.2, random_state=123)
y_test_origion = y_test.copy()
# To check the one-hot encoder is correct.
print("y_train")
print(y_train[:3])
print("y_test")
print(y_test[:3])
y_train = pd.get_dummies(y_train)
y_test = pd.get_dummies(y_test)
print("y_train with one-hot encoder")
print(y_train[:3])
print("y_test with one-hot encoder")
print(y_test[:3])

y_train
329    1
749    3
203    6
Name: AgeCat, dtype: category
Categories (10, int64): [0 < 1 < 2 < 3 ... 6 < 7 < 8 < 9]
y_test
172    0
524    3
452    2
Name: AgeCat, dtype: category
Categories (10, int64): [0 < 1 < 2 < 3 ... 6 < 7 < 8 < 9]
y_train with one-hot encoder
AgeCat  0  1  2  3  4  5  6  7  8  9
329     0  1  0  0  0  0  0  0  0  0
749     0  0  0  1  0  0  0  0  0  0
203     0  0  0  0  0  0  1  0  0  0
y_test with one-hot encoder
AgeCat  0  1  2  3  4  5  6  7  8  9
172     1  0  0  0  0  0  0  0  0  0
524     0  0  0  1  0  0  0  0  0  0
452     0  0  1  0  0  0  0  0  0  0

In [52]:
import numpy as np
#from __future__ import absolute_import

from keras.models import Sequential
from keras.layers import Dense, Activation, Dropout
from keras.regularizers import l2, l1

in_dim = X_train.shape[1]
model = Sequential()

model.add(Dense(1200, input_dim=in_dim, init='normal', activation='relu'))
model.add(Dropout(0.1))
model.add(Dense(1000, init='normal', activation='relu'))
model.add(Dropout(0.1))
model.add(Dense(500, init='normal', activation='relu'))
model.add(Dropout(0.1))
model.add(Dense(100, init='normal', activation='relu'))
model.add(Dropout(0.1))
model.add(Dense(100, init='normal', activation='relu'))
model.add(Dropout(0.1))
model.add(Dense(10, init='normal', activation='sigmoid'))
model.compile(loss='categorical_crossentropy', optimizer='adam' ,metrics = ['accuracy'])
# model1.compile(loss = 'categorical_crossentropy', optimizer='adam',metrics = ['accuracy'])
model.fit(X_train, y_train, nb_epoch=6, batch_size=32)

model.save('model_and_param_50_epoch.h5')

/Users/jim/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:11: UserWarning: Update your `Dense` call to the Keras 2 API: `Dense(1200, input_dim=30, activation="relu", kernel_initializer="normal")`
  # This is added back by InteractiveShellApp.init_path()
/Users/jim/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:13: UserWarning: Update your `Dense` call to the Keras 2 API: `Dense(1000, activation="relu", kernel_initializer="normal")`
  del sys.path[0]
/Users/jim/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:15: UserWarning: Update your `Dense` call to the Keras 2 API: `Dense(500, activation="relu", kernel_initializer="normal")`
  from ipykernel import kernelapp as app
/Users/jim/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:17: UserWarning: Update your `Dense` call to the Keras 2 API: `Dense(100, activation="relu", kernel_initializer="normal")`
/Users/jim/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:19: UserWarning: Update your `Dense` call to the Keras 2 API: `Dense(100, activation="relu", kernel_initializer="normal")`
/Users/jim/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:21: UserWarning: Update your `Dense` call to the Keras 2 API: `Dense(10, activation="sigmoid", kernel_initializer="normal")`
/Users/jim/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:24: UserWarning: The `nb_epoch` argument in `fit` has been renamed `epochs`.

Epoch 1/6
712/712 [==============================] - 2s 3ms/step - loss: 1.8796 - acc: 0.2921
Epoch 2/6
712/712 [==============================] - 1s 837us/step - loss: 1.2993 - acc: 0.3244
Epoch 3/6
712/712 [==============================] - 1s 824us/step - loss: 1.0176 - acc: 0.3989
Epoch 4/6
712/712 [==============================] - 1s 831us/step - loss: 0.8386 - acc: 0.5744
Epoch 5/6
712/712 [==============================] - 1s 843us/step - loss: 0.6477 - acc: 0.7360
Epoch 6/6
712/712 [==============================] - 1s 840us/step - loss: 0.6825 - acc: 0.6742

In [53]:
from keras.models import load_model
model = load_model("model_and_param_50_epoch.h5")

# Test Accuracy is 0.54 - not bad.

In [54]:
result = model.predict_classes(X_test)
rightnum = 0
for i in result:
    if result[i] == y_test_origion.values[i]:
        rightnum += 1
        
print("test accuracy: ", rightnum/result.shape[0])

test accuracy:  0.5810055865921788

# Take a look at the prediction.

In [55]:
print("Should be: ", y_test_origion[:10].values)
print("Predicted: ", model.predict_classes(X_test[:10]))

Should be:  [0, 3, 2, 8, 2, 6, 4, 2, 1, 2]
Categories (10, int64): [0 < 1 < 2 < 3 ... 6 < 7 < 8 < 9]
Predicted:  [1 3 2 5 2 5 4 2 1 2]

In [56]:
proba = model.predict_proba(X_test[:1])
print(proba)
# get the top 3
np.argpartition(proba[0], -3)[-3:]

[[0.99999225 1.         1.         0.         0.         0.
  0.         0.         0.         0.        ]]

array([0, 2, 1])

# See the top 3 coverage - 89%

In [57]:
prob_result = model.predict_proba(X_test)
rightnum = 0
for i in np.arange(0, prob_result.shape[0]):  # loop all predictions
    for j in np.argpartition(prob_result[i], -3)[-3:]: # loop the top 3 classes in i-th prediction
        if j == y_test_origion.values[i]:
            rightnum += 1
        
print("test accuracy: ", rightnum/result.shape[0])

test accuracy:  0.9664804469273743